{
    "version": "https://jsonfeed.org/version/1",
    "title": "Fred VG&#x27;s Feed",
    "description": "",
    "home_page_url": "https://fredvg.com",
    "feed_url": "https://fredvg.com/feed.json",
    "user_comment": "",
    "icon": "https://fredvg.com/media/website/SVG-Logo.svg",
    "author": {
        "name": "Frederik Van Geloven"
    },
    "items": [
        {
            "id": "https://fredvg.com/bruce-springsteen.html",
            "url": "https://fredvg.com/bruce-springsteen.html",
            "title": "This Machine Kills Fascists",
            "summary": "<p><a href=\"https://youtu.be/wWKSoxG1K7w?si=omeIuoGwD-T4ln73\">Bruce Springsteen — Streets of Minneapolis</a></p>\n<p>Woody Guthrie would be proud. We need more of this. Every single American needs to speak up and take a stand. When we look back, \"I didn't know\" or \"I didn't want to make things political\" won't be an acceptable excuse. You <em>do</em> know, and <em>everything</em> is political.</p>\n",
            "content_html": "<p><a href=\"https://youtu.be/wWKSoxG1K7w?si=omeIuoGwD-T4ln73\">Bruce Springsteen — Streets of Minneapolis</a></p>\n<p>Woody Guthrie would be proud. We need more of this. Every single American needs to speak up and take a stand. When we look back, \"I didn't know\" or \"I didn't want to make things political\" won't be an acceptable excuse. You <em>do</em> know, and <em>everything</em> is political.</p>\n\n<p> </p>",
            "author": {
                "name": "Frederik Van Geloven"
            },
            "tags": [
                   "Notes",
                   "About"
            ],
            "date_published": "2026-01-28T18:56:22-05:00",
            "date_modified": "2026-01-28T19:01:59-05:00"
        },
        {
            "id": "https://fredvg.com/taste.html",
            "url": "https://fredvg.com/taste.html",
            "title": "Taste",
            "summary": "<blockquote>\n<p><span class=\"\">This is taste. The relentless, almost painful ability to know what should exist, what shouldn't, and where quality matters.</span></p>\n</blockquote>\n<p><a href=\"https://www.linkedin.com/pulse/taste-sarah-guo-u9qcf\">Taste — Sarah Guo</a></p>\n",
            "content_html": "<blockquote>\n<p><span class=\"\">This is taste. The relentless, almost painful ability to know what should exist, what shouldn't, and where quality matters.</span></p>\n</blockquote>\n<p><a href=\"https://www.linkedin.com/pulse/taste-sarah-guo-u9qcf\">Taste — Sarah Guo</a></p>\n\n<p> </p>",
            "author": {
                "name": "Frederik Van Geloven"
            },
            "tags": [
                   "Inspiration"
            ],
            "date_published": "2026-01-19T16:06:50-05:00",
            "date_modified": "2026-01-19T16:06:50-05:00"
        },
        {
            "id": "https://fredvg.com/dream-job-experience-design-at-tracksmith.html",
            "url": "https://fredvg.com/dream-job-experience-design-at-tracksmith.html",
            "title": "Dream job: Experience Design at Tracksmith",
            "summary": "Another dream job I sometimes daydream about: Experience Designer at Tracksmith. If you don't know Tracksmith, they're a New England running brand with an aesthetic that's a bit vintage, a bit classical, but with a modern, minimalist edge. Think wool singlets and split shorts that&hellip;",
            "content_html": "<p class=\"font-claude-response-body whitespace-normal break-words\">Another dream job I sometimes daydream about: Experience Designer at Tracksmith.</p>\n<p class=\"font-claude-response-body whitespace-normal break-words\">If you don't know <a href=\"https://www.tracksmith.com/\">Tracksmith</a>, they're a New England running brand with an aesthetic that's a bit vintage, a bit classical, but with a modern, minimalist edge. Think wool singlets and split shorts that wouldn't look out of place in a 1970s marathon, but designed for today. They're based in Boston, about two hours from me.</p>\n<p class=\"font-claude-response-body whitespace-normal break-words\">The job would split three ways. Half my time on UX/UI/interaction design — they already do excellent work here, so I'd be taking things from excellent to extraordinary. A quarter of my time on service design and marketing strategy, looking at their processes and experiences across online shopping, in-store sales, their flagship locations, and the many events they organize. The final quarter would be logistics — helping at photo shoots, events, interfacing with their running club members.</p>\n<p class=\"font-claude-response-body whitespace-normal break-words\">Why this appeals: They're a super cool brand that feels perfectly aligned with my personal aesthetic and values. Quintessentially New England. I've been running three days a week for the past few years, and I've come to see it as a mindfulness practice. Some of their marketing leans into that too — their <a href=\"https://www.tracksmith.com/journal/article/church-of-the-long-run-film\">Church of the Long Run</a> video captures exactly what I mean about running as meditation. And finally, there's something inspiring about working on a project that's already pretty great. You get a head start.</p>\n<p class=\"font-claude-response-body whitespace-normal break-words\">Why it might never happen: They're already doing well, so they might not need me. And if they do need me in Boston or at events, I'm looking at a two-hour-plus commute. I wouldn't be able to go into the office more than a couple times a month, which might not be enough. Still, they seem like a smart bunch, so they might be able to work with me on these hurdles (no pun intended).</p>",
            "author": {
                "name": "Frederik Van Geloven"
            },
            "tags": [
                   "Dream job",
                   "AI-assist"
            ],
            "date_published": "2026-01-09T15:06:00-05:00",
            "date_modified": "2026-01-28T19:51:35-05:00"
        },
        {
            "id": "https://fredvg.com/grady-hendrix-my-best-friends-exorcism.html",
            "url": "https://fredvg.com/grady-hendrix-my-best-friends-exorcism.html",
            "title": "Grady Hendrix — My Best Friend&#x27;s Exorcism",
            "summary": "<p><a href=\"https://www.gradyhendrix.com/#/my-best-friends-exorcism/\">Grady Hendrix — My Best Friend's Exorcism</a></p>\n",
            "content_html": "<p><a href=\"https://www.gradyhendrix.com/#/my-best-friends-exorcism/\">Grady Hendrix — My Best Friend's Exorcism</a></p>\n\n<p> </p>",
            "author": {
                "name": "Frederik Van Geloven"
            },
            "tags": [
                   "Read"
            ],
            "date_published": "2025-12-23T19:36:45-05:00",
            "date_modified": "2025-12-23T19:36:45-05:00"
        },
        {
            "id": "https://fredvg.com/oh-my-ai.html",
            "url": "https://fredvg.com/oh-my-ai.html",
            "title": "Oh my, AI!",
            "summary": "I’ll be honest with you, I don’t love the idea of artificial intelligence. There are many things about it I don’t like. Even the basic premise, that this technology is intelligent doesn’t match my definition of the term. Real intelligence requires more than connecting a&hellip;",
            "content_html": "<p class=\"p1\"><span class=\"s1\">I’ll be honest with you, I don’t love the idea of artificial intelligence. There are many things about it I don’t like. Even the basic premise, that this technology is intelligent doesn’t match my definition of the term. Real intelligence requires more than connecting a bunch of data points. Sure, it can create things from scratch, and it’s great at recognizing and replicating patterns. But is that creativity, or can we consider that<i> thinking</i>? I don’t believe it is. And yes, believe is the word I meant to use. Because the definition of these terms — intelligence, creativity, thinking — is somewhat subjective.</span></p>\n<p class=\"p1 msg msg--highlight \"><span class=\"s1\">Aside: I know these words have clear definitions and meanings. But some words can’t be perfectly described. Don’t worry, I won’t get into my philosophy of semiotics here. Back to the main topic!</span></p>\n<p class=\"p1\"><span class=\"s1\">So yes, I generally dislike AI. You can read all about the environmental concerns, ethical issues, and potential apocalyptic consequences elsewhere.</span></p>\n<p class=\"p1\"><span class=\"s1\">The reality is, AI is unavoidable now. And — as a digital designer — it’s (part of) my job to keep up with it.</span></p>\n<p class=\"p1\"><span class=\"s1\">One of the ways I’ve been experimenting, is collaborating on posts here. I used some of my older posts to train an LLM assistant (I used Claude, but I believe they are all pretty much interchangeable when it comes to this). It did a decent job at capturing my voice and tone. Which, I have to admit, was a bit unsettling and cringe-worthy. It’s like looking back at older work. Except AI tends to amplify things, which makes the way the assistant writes almost a caricature of my style.</span></p>\n<p class=\"p1\"><span class=\"s1\">One of the things it learned about me is that I often start with a musing or by asking the reader a question. Which is true, but … Actually, hold that thought. I’ll get back to it.</span></p>\n<p class=\"p1\"><span class=\"s1\">After my robot friend — JK, it’s a bunch of 1s and 0s, not a friend — had learned to write in my voice, I gave it an outline for the <a href=\"https://fredvg.com/dream-job-park-hill-orchard-farmer.html\">Dreamjob: Parkhill Orchard Farmer</a> post. The results weren’t terrible but definitely needed editing. I tried to only do a light edit because I wanted to use it as an example of my experimenting.</span></p>\n<p class=\"p1\"><span class=\"s1\">If you read the post, you might notice how often my AI assistant and I ask the reader a question. I’d like to think I’m less heavy-handed with that stylistic technique. It also amplified and over-used some of my other signature moves. It’s hard for me to judge how easy it is for someone to notice that the writing isn’t 100% mine. I would hope you notice, but I’m afraid you might not.</span></p>\n<p class=\"p1 msg msg--highlight \"><span class=\"s1\"><strong>TLDR:</strong> AI is helpful, and can already save time and effort. And because of the way it works, it’ll continue to get better. I worry that it’ll always stay somewhat formulaic though. Is it intelligent? Or can it be trusted to work on its own? I don’t yet think so, and I’m not sure we’ll ever get there. If we do, we’ll have bigger things to worry about. Our <em>intelligence</em> is what put us at the top of the food chain. Guess who will take our spot once it's able to <em>outthink </em>us.</span></p>\n<p class=\"p1\"><span class=\"s1\">PS: I did <em>not</em> co-write this post with AI. So far I’ve only used it for the Dreamjob postings. For transparency, AI experiments are tagged with the <a href=\"https://fredvg.com/tags/ai-assist/\">AI-assist tag</a>.</span></p>",
            "author": {
                "name": "Frederik Van Geloven"
            },
            "tags": [
                   "Notes"
            ],
            "date_published": "2025-12-12T08:25:00-05:00",
            "date_modified": "2025-12-14T11:43:21-05:00"
        },
        {
            "id": "https://fredvg.com/dream-job-park-hill-orchard-farmer.html",
            "url": "https://fredvg.com/dream-job-park-hill-orchard-farmer.html",
            "title": "Dream job: Park Hill Orchard Farmer",
            "summary": "With all the volatility that's been going on at work, I've been thinking about dream jobs lately. Not the ambitious, climb-the-ladder kind. The other kind — jobs that sound genuinely pleasant to do day-to-day, even if they might never happen. First up: farmer at Park&hellip;",
            "content_html": "<p class=\"font-claude-response-body whitespace-normal break-words\">With all the volatility that's been going on at work, I've been thinking about dream jobs lately. Not the ambitious, climb-the-ladder kind. The other kind — jobs that sound genuinely pleasant to do day-to-day, even if they might never happen.</p>\n<p class=\"font-claude-response-body whitespace-normal break-words\">First up: farmer at Park Hill Orchard.</p>\n<p class=\"font-claude-response-body whitespace-normal break-words\">Picture this: The bulk of the work would be outside. Tending to the orchard, mowing grass, maintaining pathways and infrastructure. Seventy-five percent of my time spent with my hands in the dirt or on a tractor. There's something appealing about work that's tangible and seasonal. You plant, you tend, you harvest. You literally see and can touch the results!</p>\n<p class=\"font-claude-response-body whitespace-normal break-words\">The rest of my time could be split between their digital presence — keeping the website and social media updated — and working on branding. Signage, visual merchandising, maybe nudging the brand toward an Americana, New England aesthetic that's admittedly a bit cliche for orchards like this but still a great fit.</p>\n<p class=\"font-claude-response-body whitespace-normal break-words\">Why I think this would be a dream: I can bike there year round, it's about a mile up the road from where I live. As an added bonus, I'd be working with a view of Mt. Tom all day. Did I mention they have an Art in the Orchard program? I'd love to help coordinate that — bringing together art, community, and agriculture. How's that for real-world experience and creativity?</p>\n<p class=\"font-claude-response-body whitespace-normal break-words\">Unfortunately, most dreams end with rude awakenings. I'm pretty sure they can't pay me what I'd need to provide for the family and maintain our current lifestyle. Health insurance and benefits are likely off the table. And that's not even considering the fact that they'd need to understand the value of having someone help with their marketing and branding. Most small farms see that work as a luxury, not a necessity.</p>\n<p class=\"font-claude-response-body whitespace-normal break-words\">I said it was a dream job, didn't I? But it's fun to dream about a job where the work is split between physical, creative, and digital. Where you're outside most of the day. Where the product is something people actually want and can touch, not another app or service they need to stare at a screen for.</p>\n<p class=\"font-claude-response-body whitespace-normal break-words\">Maybe I'll start a series of these. Dream jobs I'll never have but like thinking about anyway.</p>",
            "author": {
                "name": "Frederik Van Geloven"
            },
            "tags": [
                   "Work",
                   "Dream job",
                   "AI-assist"
            ],
            "date_published": "2025-11-14T17:30:24-05:00",
            "date_modified": "2025-12-12T08:45:10-05:00"
        },
        {
            "id": "https://fredvg.com/another-update-open-to-work.html",
            "url": "https://fredvg.com/another-update-open-to-work.html",
            "title": "Another update — #Open-To-Work",
            "summary": "<p>Looks like I'm no longer #open-to-work...<br><br><a href=\"https://luminacorps.com/news/merger-communicate-health/\">Lumina Corps and CommunicateHealth Merge to Strengthen Health Communication Impact.</a></p>\n",
            "content_html": "<p>Looks like I'm no longer #open-to-work...<br><br><a href=\"https://luminacorps.com/news/merger-communicate-health/\">Lumina Corps and CommunicateHealth Merge to Strengthen Health Communication Impact.</a></p>\n\n<p> </p>",
            "author": {
                "name": "Frederik Van Geloven"
            },
            "tags": [
                   "Notes",
                   "About"
            ],
            "date_published": "2025-11-09T16:14:36-05:00",
            "date_modified": "2025-11-09T16:16:06-05:00"
        },
        {
            "id": "https://fredvg.com/figmas-color-contrast-checker.html",
            "url": "https://fredvg.com/figmas-color-contrast-checker.html",
            "title": "Figma&#x27;s Color Contrast Checker",
            "summary": "Figma's built-in color contrast checker is so helpful! I used to rely on a few different plugins to check color contrast. Some of those had features Figma is missing, but I love how integrated the Figma tool is. The line and dotted pattern to indicate&hellip;",
            "content_html": "<p>Figma's built-in color contrast checker is so helpful! I used to rely on a few different plugins to check color contrast. Some of those had features Figma is missing, but I love how integrated the Figma tool is. The line and dotted pattern to indicate where the contrast falls below the standard you are checking for is such a great feature. Of course there's room for improvement. And Figma has a long way to go before they can claim to be front-runners when it comes to accessibility features. But this seemingly small feature, is a huge step in the right direction.</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://fredvg.com/media/posts/29/Figma-Color-Contrast-Checker.png\" alt=\"A screenshot of the Figma color picker tool with built-in contrast checker.\" width=\"1402\" height=\"1014\" sizes=\"(max-width: 1920px) 100vw, 1920px\" srcset=\"https://fredvg.com/media/posts/29/responsive/Figma-Color-Contrast-Checker-xs.png 640w ,https://fredvg.com/media/posts/29/responsive/Figma-Color-Contrast-Checker-sm.png 768w ,https://fredvg.com/media/posts/29/responsive/Figma-Color-Contrast-Checker-md.png 1024w ,https://fredvg.com/media/posts/29/responsive/Figma-Color-Contrast-Checker-lg.png 1366w ,https://fredvg.com/media/posts/29/responsive/Figma-Color-Contrast-Checker-xl.png 1600w ,https://fredvg.com/media/posts/29/responsive/Figma-Color-Contrast-Checker-2xl.png 1920w\"></figure>",
            "author": {
                "name": "Frederik Van Geloven"
            },
            "tags": [
                   "Notes",
                   "Inspiration"
            ],
            "date_published": "2025-10-17T09:01:51-04:00",
            "date_modified": "2025-10-17T09:01:51-04:00"
        },
        {
            "id": "https://fredvg.com/update-open-to-work.html",
            "url": "https://fredvg.com/update-open-to-work.html",
            "title": "Update — #Open-To-Work",
            "summary": "An update to my #Open-To-Work post is in order. Turns out, we retained some of the contracts that we thought were ending. While the situation in public health communication and govtech design is still volatile, it looks like my tenure at CommunicateHealth can continue for&hellip;",
            "content_html": "<p>An update to my <a href=\"https://fredvg.com/opentowork.html\">#Open-To-Work</a> post is in order.</p>\n<p>Turns out, we retained some of the contracts that we thought were ending. While the situation in public health communication and govtech design is still volatile, it looks like my tenure at <a href=\"https://communicatehealth.com\">CommunicateHealth</a> can continue for now.</p>\n<p>That said, my invitation to connect still stands. Whether you are hiring, or are navigating this crazy UX jobmarket, I'd <a href=\"https://www.linkedin.com/in/fredvg\">love to connect</a> and chat about how we can help each other out.</p>",
            "author": {
                "name": "Frederik Van Geloven"
            },
            "tags": [
                   "Notes",
                   "About"
            ],
            "date_published": "2025-10-08T15:40:00-04:00",
            "date_modified": "2025-11-09T16:16:16-05:00"
        },
        {
            "id": "https://fredvg.com/drishti-mauryas-wardrobe-data-visualization.html",
            "url": "https://fredvg.com/drishti-mauryas-wardrobe-data-visualization.html",
            "title": "Drishti Maurya&#x27;s Wardrobe Data Visualization",
            "summary": "<p>How cool is <a href=\"https://www.behance.net/gallery/229098685/Wardrobe-Data-Visualization#\">this dataviz project</a>?!</p>\n",
            "content_html": "<p>How cool is <a href=\"https://www.behance.net/gallery/229098685/Wardrobe-Data-Visualization#\">this dataviz project</a>?!</p>\n\n<p> </p>",
            "author": {
                "name": "Frederik Van Geloven"
            },
            "tags": [
                   "Inspiration"
            ],
            "date_published": "2025-10-05T15:05:00-04:00",
            "date_modified": "2025-10-08T16:07:25-04:00"
        }
    ]
}
